<a href="https://colab.research.google.com/github/pd047/Pandas-Basics/blob/main/2)%20Knowing_the_data_Occupation_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Import dataset from url assign user_id as index

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

# See the 1st 10 and last 10 entries

In [ ]:
df.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [ ]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# No. of observations and columns

In [ ]:
df.shape[0]

943

In [ ]:
df.shape[1]

4

# Columns

In [ ]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# How is the dataset indexed?

In [ ]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# Data type of each column

In [ ]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Print only the occupation column

In [ ]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations there are in this dataset?

In [ ]:
df.occupation.nunique()

21

In [ ]:
df.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

# What is the most frequent occupation?

In [ ]:
df.occupation.value_counts().head(1).index[0]

'student'

# Summarize the DataFrame

In [ ]:
df.describe()                ## since 'age' is the only numerical column

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [ ]:
df.describe(include = "all")            # to include categorical columns

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [ ]:
df.occupation.describe()          ## only 'occupation' column

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# Mean age of users

In [ ]:
df.age.mean()

34.05196182396607

In [ ]:
round(df.age.mean())

34

# What is the age with least occurrence?

In [ ]:
df.age.value_counts().tail(5)

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64